742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include "taskApp.h"
#include "delay.h"
#include "user_call_back.h"
#include "wireless_app.h"
#include "wireless_drv.h"
#include "uart.h"
#include "stmflash.h"
#include "led.h"
#include "frame_process.h"
#include "stm32f0_eeprom.h"
#include "aes.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;



/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t uart1_rec;
uint8_t uart2_rec;


//根据家庭组切换到新的固定通讯频道上
#ifdef Use_Rx_Hop
void Get_WireLessChannel(uint8_t *wire_chnel)
{
   uint32_t temp_val = LANGroup_Addr[0] + LANGroup_Addr[1] + LANGroup_Addr[2];
	
   //uint32_t temp_val = 0x00 + 0x29 + 0x02;
   //uint32_t temp_val = 0x00 + 0x2A + 0x5B;
    if (temp_val == 0)
    {
        wire_chnel[0] = Default_Channel;
        wire_chnel[1] = Default_Channel;
    }
    else
    {
        wire_chnel[0] = (temp_val & 0x1f) << 1; //共32个信道组，每个信道组有两个信道
        wire_chnel[1] = wire_chnel[0] + 1;
		if(wire_chnel[0] == Default_Channel)
		{
			wire_chnel[0] = wire_chnel[0] + 2;
			wire_chnel[1] = wire_chnel[0] + 1;
		} 
    }

	
  
    RF_RX_HOP_CONTROL_12[7] = Channel_Frequency_Index[wire_chnel[0]]; //放入群组的主频道
    RF_RX_HOP_CONTROL_12[8] = Channel_Frequency_Index[wire_chnel[1]]; //放入群组的备用频道
}
#else
void Get_WireLessChannel(uint8_t *wire_chnel)
{
	wire_chnel[0] = Default_Channel;
	wire_chnel[1] = Default_Channel;
}
#endif
//LED旋转灯测试
void PowerOn_Led(void)
{
    //Fashion_ParaBuf.Led4_CotrolPara = 0x43;
    //LED_SetALed(4, Purple, 63);
    LED_SetDuty(Purple, 63);
    LED_SetALed(4, Purple, 63);
    SysDelay_Xms(2000);

    LED_Clear(0);
}

void TouchLED_ALL(uint8_t flag)
{
	if(flag == 1)
	{
		LED_SetDuty(Purple, 63);
		LED_SetALed(4, Purple, 63);
	}
	else
	{
	   LED_Clear(0);
	}
}

void UpCom_Process(UpCom_Rx_TypDef *prx_ubuf, DevicePara_TypDef *p_device)
{

    if (prx_ubuf->Rx_Status == UartRx_Finished)
    {
        prx_ubuf->Rx_Status = UartRx_FrameHead;
        if (0 == FrameData_Detect(prx_ubuf->Frame_Data, prx_ubuf->FrameTotalLen))
        {
            p_device->Pending_Flag &= 0xf0; //
            LEDR_INVERSE();

            if (prx_ubuf->Frame_Data[0] == AESFreamHeader)
                p_device->Pending_Flag |= 0x01;
            else
            {
                uint8_t frame_type = prx_ubuf->Frame_Data[Region_CmdNumber] & 0x98;

                if (frame_type == RemoteUp_CmdFrame)
                {
                    p_device->Pending_Flag |= 0x02;
#ifdef Use_Rout
                    Dis_TryFlag = 1;
                    prx_ubuf->Frame_Data[Region_SeqNumber] &= 0x7f;
#endif
                }

                else if (frame_type == Local_EventFrame || frame_type == RemoteUp_EventFrame)
                    p_device->Pending_Flag |= 0x03;
                else if (frame_type == Local_CmdFrame)
                    p_device->Pending_Flag |= 0x04;
                else
                {
                    // UpCom_RXINT_EN();
                }
            }
        }
        else
        {
            // UpCom_RXINT_EN();
        }
    }
}

void WireLess_Process(WLS *p_wl, DevicePara_TypDef *p_device)
{
    static uint8_t Wireless_ErrCnt = 0;

