742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
    // Get_WireLessChannel(Wireless_Channel);

    if (WIRELESS_ERROR_CODE == Wireless_CmdResponseError)
    {
        WIRELESS_ERROR_CODE = Wireless_NoError;
        /*Si4438_Receive_Start(Wireless_Channel[0]);   //Start Receive*/
        if (++Wireless_ErrCnt > 10)
            WIRELESS_ERROR_CODE = Wireless_InitError;
    }

    if (WIRELESS_ERROR_CODE == Wireless_ExecuteError) //Channel Busy
    {
        WIRELESS_STATUS = Wireless_Free;

        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    if (WIRELESS_STATUS == Wireless_TX_Finish)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        //LEDR_INVERSE();
        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    else if (WIRELESS_STATUS == Wireless_RX_Failure)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        Res_FifoInfo(RESET_RECEIVE);
        //Si4438_Receive_Start(Wireless_Channel[0]);         //Start Receive
    }

    else if (WIRELESS_STATUS == Wireless_RX_Finish) //Receive Finish
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;

        if (0 == FrameData_Detect(p_wl->Wireless_RxData, p_wl->Wireless_PacketLength))
        {
#ifdef Use_74dcode
            if (((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X07) && ((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X02)) //带编码能力的电器回复无cmd标识
            {
                uint8_t Datacnt = Region_DataAFNNumber, Realcnt = 0;
                volatile uint16_t dest;
                uint8_t Datalength = (p_wl->Wireless_PacketLength - 9) / 2; //从数据区到校验区开始解码

                while (Datalength--)
                {
                    dest = (p_wl->Wireless_RxData[Datacnt]);
                    dest = dest << 8;
                    dest |= p_wl->Wireless_RxData[Datacnt + 1];                //接收到的是单位1Byte的74码数据，处理成2Byte解码使用
                    p_wl->Wireless_RealData[Realcnt++] = decode16_74bit(dest); //解码成真实数据
                    Datacnt += 2;
                }
                memset(&p_wl->Wireless_RxData[Region_DataAFNNumber], (uint8_t)0, p_wl->Wireless_PacketLength); //把接收到的编码帧清除，否则会有无用数据在帧的后缀出现
                memmove(&p_wl->Wireless_RxData[Region_DataAFNNumber], p_wl->Wireless_RealData, Realcnt);       //把真实长度的数据放到接收数据buf中
                memset(p_wl->Wireless_RealData, (uint8_t)0, Realcnt);
                p_wl->Wireless_PacketLength = Realcnt + Region_DataAFNNumber; //数据校验区加协议区总长度
            }
#endif

            uint8_t frame_type = p_wl->Wireless_RxData[Region_CmdNumber] & 0x98;
#ifdef Use_Rout
            uint8_t rout_flag = p_wl->Wireless_RxData[Region_SeqNumber] & 0x80;
            uint8_t Remain_series = p_wl->Wireless_RxData[Region_DataAFNNumber + p_wl->Wireless_RxData[Region_DataLenNumber] + 1];
#endif

            p_device->Pending_Flag &= 0x0f;
            LEDG_INVERSE();
#ifdef Use_Rout
            if ((frame_type == RemoteDown_CmdFrame) && (!rout_flag || (rout_flag && !Remain_series)))
                p_device->Pending_Flag |= 0x10;
            else if ((frame_type == RemoteDown_EventFrame) && (!rout_flag || (rout_flag && !Remain_series)))
                p_device->Pending_Flag |= 0x20;
#else
            if (frame_type == RemoteDown_CmdFrame)
                p_device->Pending_Flag |= 0x10;
            else if (frame_type == RemoteDown_EventFrame)
                p_device->Pending_Flag |= 0x20;
#endif
            else
                Si4438_Receive_Start(Wireless_Channel[0]);
        }
        else if (p_wl->Wireless_RxData[Region_HeaderNumber] == HKFreamHeader) //帧校验错误时但为正确格式，尝试解码纠错
        {
#ifdef Use_74dcode
            //无线帧校验错误尝试解码恢复数据
            if (((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X07) && ((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X02)) //带编码能力的电器回复无cmd标识，可以尝试解码恢复
            {
                uint8_t Datacnt = Region_DataAFNNumber, Realcnt = 0;
                volatile uint16_t dest;
                uint8_t Datalength = (p_wl->Wireless_PacketLength - 9) / 2; //从数据区到校验区开始解码

                while (Datalength--)
                {
                    dest = (p_wl->Wireless_RxData[Datacnt]);
                    dest = dest << 8;
                    dest |= p_wl->Wireless_RxData[Datacnt + 1];                //接收到的是单位1Byte的74码数据，处理成2Byte解码使用
                    p_wl->Wireless_RealData[Realcnt++] = decode16_74bit(dest); //解码成真实数据
                    Datacnt += 2;
                }
                memset(&p_wl->Wireless_RxData[Region_DataAFNNumber], (uint8_t)0, p_wl->Wireless_PacketLength); //把接收到的编码帧清除，否则会有无用数据在帧的后缀出现
                memmove(&p_wl->Wireless_RxData[Region_DataAFNNumber], p_wl->Wireless_RealData, Realcnt);       //把真实长度的数据放到接收数据buf中
                memset(p_wl->Wireless_RealData, (uint8_t)0, Realcnt);
                p_wl->Wireless_PacketLength = Realcnt + Region_DataAFNNumber; //数据校验区加协议区总长度
            }
            else //不带编码能力的电器回复校验错误直接返回
            {
                Si4438_Receive_Start(Wireless_Channel[0]);
                return;
            }
#endif
#ifdef Use_74dcode
            //校验解码后的帧是否正确
            if (0 == FrameData_Detect(p_wl->Wireless_RxData, p_wl->Wireless_PacketLength))
            {
                uint8_t frame_type = p_wl->Wireless_RxData[Region_CmdNumber] & 0x98;
#ifdef Use_Rout
                uint8_t rout_flag = p_wl->Wireless_RxData[Region_SeqNumber] & 0x80;
                uint8_t Remain_series = p_wl->Wireless_RxData[Region_DataAFNNumber + p_wl->Wireless_RxData[Region_DataLenNumber] + 1];
#endif

                p_device->Pending_Flag &= 0x0f;
                LEDG_INVERSE();
#ifdef Use_Rout
                if ((frame_type == RemoteDown_CmdFrame) && (!rout_flag || (rout_flag && !Remain_series)))
                    p_device->Pending_Flag |= 0x10;
                else if ((frame_type == RemoteDown_EventFrame) && (!rout_flag || (rout_flag && !Remain_series)))
                    p_device->Pending_Flag |= 0x20;
#else
                if (frame_type == RemoteDown_CmdFrame)
                    p_device->Pending_Flag |= 0x10;
                else if (frame_type == RemoteDown_EventFrame)
                    p_device->Pending_Flag |= 0x20;
#endif
                else
                    Si4438_Receive_Start(Wireless_Channel[0]);
            }
            else
                Si4438_Receive_Start(Wireless_Channel[0]);
#else
            Si4438_Receive_Start(Wireless_Channel[0]);
#endif
        }
        else
            Si4438_Receive_Start(Wireless_Channel[0]);
    }
}

void System_8msTick_Process(void)
{
    if ((WIRELESS_STATUS == Wireless_RX_Receiving) && (!!NIRQ_RDPIN() == 0))
    {
        Si4438_Receive_Start(Wireless_Channel[0]); //Restart Receive
    }
    if ((WIRELESS_ERROR_CODE == Wireless_Busy)) //Channel Busy
    {
        if (Wireless_Buf.Channel_Busy_cnt) // Send Ready
        {
            if (++Wireless_Buf.Channel_Busy_cnt > BUSY_TIMEOUT)
            {
                Wireless_Buf.Channel_Busy_cnt = 0;

