742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
                //Set_Property(Interrupt_Close);
                WIRELESS_ERROR_CODE = Wireless_NoError;
                Si4438_Receive_Start(Wireless_Channel[0]);
            }
        }
        else
            WIRELESS_ERROR_CODE = Wireless_NoError;
    }
    if (WirelessRx_Timeout_Cnt)
    {
        if (++WirelessRx_Timeout_Cnt > WirelessRx_Timeout_Threshold)
        {
            WirelessRx_Timeout_Cnt = 0;

            Si4438_Receive_Start(Wireless_Channel[0]);
        }
    }
    if (Wireless_Buf.Sent_TimeOut_Cnt > 0)
    {
        if (++Wireless_Buf.Sent_TimeOut_Cnt > WLSent_TimeOut_Val)
        {
            Wireless_Buf.Sent_TimeOut_Cnt = 0;
            WIRELESS_STATUS = Wireless_TX_Finish;
        }
    }
    if (UpCom_TxBuf.Tx_Status == UartTx_End)
    {
        if (++UpCom_TxBuf.TxEnd_Cnt > Tx_GapTime_Size)
        {
            UpCom_TxBuf.TxEnd_Cnt = 0;
            UpCom_TxBuf.Tx_Status = UartTx_Finished;
        }
    }
    if (UpCom_RxBuf.Over_time_count)
    {
        if (++UpCom_RxBuf.Over_time_count > Up_TimeOut_Val)
        {
            UpCom_RxBuf.Over_time_count = 0;
            UpCom_RxBuf.Rx_Status = UartRx_FrameHead;
        }
    }
#ifdef Use_Rout
    if (Frame_Wait_Cnt)
    {
        Frame_Wait_Cnt++;
    }
#endif
}

void Led_Process(DevicePara_TypDef *p_device, Led_Color_TypeDef colour)
{

    if ((p_device->Touch_State & 0x10) == 0x10)
    {
        p_device->Touch_State &= ~0x10;
        p_device->Led_Cotrol_DisFlag |= 0x01;
        LED_Clear(1);
        LED_SetALed(0, colour, 20);
        LED_SetALed(1, colour, 20);
    }
    else if ((p_device->Touch_State & 0x01) == 0x01)
    {
        p_device->Touch_State &= ~0x01;
        p_device->Led_Cotrol_DisFlag &= ~0x01;
        LED_SetALed(0, colour, 0);
        LED_SetALed(1, colour, 0);
    }
#if (0)
    if ((p_device->Touch_State & 0x20) == 0x20)
    {
        p_device->Touch_State &= ~0x20;
        p_device->Led_Cotrol_DisFlag |= 0x02;
        LED_Clear(1);
        LED_SetALed(2, colour, 20);
        LED_SetALed(3, colour, 20);
    }
    else if ((p_device->Touch_State & 0x02) == 0x02)
    {
        p_device->Touch_State &= ~0x02;
        p_device->Led_Cotrol_DisFlag &= ~0x02;
        LED_SetALed(2, colour, 0);
        LED_SetALed(3, colour, 0);
    }
#endif
    if ((p_device->Touch_State & 0x40) == 0x40)
    {
        p_device->Touch_State &= ~0x40;
        p_device->Led_Cotrol_DisFlag |= 0x04;
        LED_Clear(1);
        LED_SetALed(5, colour, 20);
        LED_SetALed(6, colour, 20);
    }
    else if ((p_device->Touch_State & 0x04) == 0x04)
    {
        p_device->Touch_State &= ~0x04;
        p_device->Led_Cotrol_DisFlag &= ~0x04;
        LED_SetALed(5, colour, 0);
        LED_SetALed(6, colour, 0);
    }
#if (0)
    if ((p_device->Touch_State & 0x80) == 0x80)
    {
        p_device->Touch_State &= ~0x80;
        p_device->Led_Cotrol_DisFlag |= 0x08;
        LED_Clear(1);
        LED_SetALed(7, colour, 20);
        LED_SetALed(8, colour, 20);
    }
    else if ((p_device->Touch_State & 0x08) == 0x08)
    {
        p_device->Touch_State &= ~0x08;
        p_device->Led_Cotrol_DisFlag &= ~0x08;
        LED_SetALed(7, colour, 0);
        LED_SetALed(8, colour, 0);
    }
#endif
    if (!p_device->Led_Cotrol_DisFlag)
    {
        uint8_t led_setmode, color_val;
        Led_Color_TypeDef led_color;

        led_setmode = (p_device->Led_CotrolPara & 0xf0) >> 4;
        color_val = p_device->Led_CotrolPara & 0x03;
        if (color_val == 0x00)
            led_color = Colourless;
        else if (color_val == 0x01)
            led_color = Blue;
        else if (color_val == 0x02)
            led_color = Orange;
        else if (color_val == 0x03)
            led_color = Purple;
        switch (led_setmode)
        {
        case Led_SetMode1:
            Led_Mode1(led_color);
            break;

        case Led_SetMode2:
            Led_Mode2(led_color);
            break;

        case Led_SetMode3:
            Led_Mode3(led_color);
            break;

        case Led_SetMode5:
            Led_Mode5(p_device, Purple);
            break;

        default:
            break;
        }
    }
    Led_Mode4(p_device);
}
void MacFrame_Process(uint8_t *p_source, uint8_t *p_buf)
{
    uint16_t crc16_val;

    if (p_source[1] == MACWrite_Cmd_Request)
    {
        if (memcmp(Local_MAC_Addr, p_source, MAC_Data_Len + 5) != 0) //只能烧一次
        {
            Eeprom_ErasePage(MAC_EAddr);
            Eeprom_Write(MAC_EAddr, (uint16_t *)p_source, MAC_Data_Len + 5);
            Eeprom_Read(MAC_EAddr, (uint16_t *)Local_MAC_Addr, MAC_Data_Len + 5);
            
            if (memcmp(Local_MAC_Addr, p_source, MAC_Data_Len + 5) == 0)
            {
                p_buf[1] = MACWrite_Yes_Response;
                p_buf[3] = 0xff;
            }
            else
            {
                p_buf[1] = MACWrite_NO_Response;
                p_buf[3] = 0x00;
            }
        }
        else
        {
            p_buf[1] = MACWrite_Yes_Response;
            p_buf[3] = 0xff;
        }
        p_buf[0] = AESFreamHeader;
        p_buf[2] = 1;
        crc16_val = CRC16_2(p_buf, 4);
        p_buf[4] = crc16_val >> 8;
        p_buf[5] = crc16_val & 0xff;

        UpUart_DataTx(p_buf, 6, &UpCom_TxBuf);
    }
}

uint8_t Remain_series;
void RxData_Process(HKFrame_TypDef *p_framebuf, DevicePara_TypDef *p_device)
{

    if (p_device->Pending_Flag & 0x0f)
    {
        uint8_t pending_val = p_device->Pending_Flag & 0x0f;

        if (pending_val == 0x01)
        {
            if (UpCom_TxBuf.Tx_Status != UartTx_Finished)
                return;
#ifdef USE_USAT_RSAKey
            AesFrame_Process(UpCom_RxBuf.Frame_Data);
#endif
            MacFrame_Process(UpCom_RxBuf.Frame_Data, p_framebuf->FrameProcess_Buf);
        }
        else
        {
            if (pending_val == 0x02)
            {
                if ((WIRELESS_STATUS == Wireless_TX_Sending))
                //UpUart_DataTx(p, 5, &UpCom_TxBuf);
#ifdef Use_Rout
                    if ((UpCom_TxBuf.Tx_Status != UartTx_Finished) || (WIRELESS_STATUS == Wireless_TX_Sending))
                        return;
#else
                    if ((UpCom_TxBuf.Tx_Status != UartTx_Finished) || (WIRELESS_STATUS == Wireless_TX_Sending))
                        return;
#endif
                //Frame_Process(Up_RxBuf.Frame_Data, Up_RxBuf.FrameTotalLen, p_framebuf, p_device);
            }
            else if (pending_val == 0x03)
            {
                //Frame_Process(Up_RxBuf.Frame_Data, Up_RxBuf.FrameTotalLen, p_framebuf, p_device);
            }
            else if (pending_val == 0x04)
            {
                if (UpCom_TxBuf.Tx_Status != UartTx_Finished)
                    return;
            }

