742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
            Frame_Process(UpCom_RxBuf.Frame_Data, UpCom_RxBuf.FrameTotalLen, p_framebuf, p_device);
        }
        p_device->Pending_Flag &= ~0x0f;
        // UpCom_RXINT_EN();
    }

    if (p_device->Pending_Flag & 0xf0)
    {
        uint8_t pending_val = p_device->Pending_Flag & 0xf0;
#ifdef Use_Rout
        uint8_t rout_flag = Wireless_Buf.Wireless_RxData[Region_SeqNumber] & 0x80;
        //uint8_t Remain_series = Wireless_Buf.Wireless_RxData[Region_DataAFNNumber + Wireless_Buf.Wireless_RxData[Region_DataLenNumber] + 1];
        Remain_series = Wireless_Buf.Wireless_RxData[Wireless_Buf.Wireless_PacketLength - 3 - 5];
#endif

#ifdef Use_Rout
        if (rout_flag && Remain_series)
        {
            p_device->Pending_Flag &= ~0xf0;
            Si4438_Receive_Start(Wireless_Channel[0]);
            return;
        }
#endif
        if (pending_val == 0x10)
        {
            if (UpCom_TxBuf.Tx_Status != UartTx_Finished)
                return;
        }
        else if (pending_val == 0x20)
        {
            if ((UpCom_TxBuf.Tx_Status != UartTx_Finished) || (WIRELESS_STATUS == Wireless_TX_Sending))
                return;
        }

        Frame_Process(Wireless_Buf.Wireless_RxData, Wireless_Buf.Wireless_PacketLength, p_framebuf, p_device);
        p_device->Pending_Flag &= ~0xf0;

        if (WIRELESS_STATUS != Wireless_TX_Sending)
            Si4438_Receive_Start(Wireless_Channel[0]);
    }
}

void Touch_Process(DevicePara_TypDef *p_device)
{
    if (!p_device->Touch_Val)
    {
        Touch1_Detect(p_device);
        Touch2_Detect(p_device);
        Touch3_Detect(p_device);
        Touch4_Detect(p_device);
        if (p_device->Touch_Val)
            p_device->UpReport_Flag |= (1 << Key_Event);
    }
}

void MacAddr_Read(void)
{
	uint32_t delay_cnt = 0;
    do
    {
        SysDelay_Xms(20);

        UpCom_Process(&UpCom_RxBuf, &Device_ParaBuf);
        RxData_Process(&HKFrame_Buf, &Device_ParaBuf);
        Eeprom_Read(MAC_EAddr, (uint16_t *)Local_MAC_Addr, MAC_Data_Len + 5);
		delay_cnt ++;
		if(delay_cnt > 50)
		{
			delay_cnt = 0;
			//DEBUG_Printf("Please input Mac Frame\r\n"); 
			UartSendData(USART1,0x0C);
		}
    } while (0 != FrameData_Detect(Local_MAC_Addr, MAC_Data_Len + 5));
}

void Aes_Key_Read(void)
{
#ifdef USE_USAT_RSAKey
    do
    {
        SysDelay_Xms(1000);
        UpCom_Process(&UpCom_RxBuf, &Device_ParaBuf);
        RxData_Process(&HKFrame_Buf, &Device_ParaBuf);
        Eeprom_Read(KEY_StartAddr, (uint16_t *)aes_out, AesBuf_Size / 2);
    } while (aes_out[AesBuf_Size - 2] != Secret_Key_Yes);
#else
    Eeprom_Read(KEY_StartAddr, (uint16_t *)aes_out, AesBuf_Size / 2);

#endif

    Secret_GKey_Flag = 1;
#if (0) //??????
    if (Secret_Key_Yes == aes_out[AesBuf_Size - 1])
    {
        memmove(LANGroup_Addr, &aes_out[RsaByte_Size * 3], 3);
        Rsa_Decode(aes_out);
        key_expansion(aes_out, aes_w);
        Secret_KeyOk_Flag = 1;
    }
#else
    memset(&aes_out[RsaByte_Size * 2], 0, 19); //???Buf?0
#endif
}

void LANGroup_AddrRead(void)
{
	uint8_t temp[4]={0};
	Eeprom_Read(GD_ADDR,(uint16_t*)temp,4/2);
	memcpy(LANGroup_Addr,temp,3);
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  delay_init(72);
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */

    HAL_TIM_Base_Start_IT(&htim1);
    HAL_UART_Receive_IT(&huart1, &uart1_rec, 1);
    HAL_UART_Receive_IT(&huart2, &uart2_rec, 1);
	SN3218_Init();
	PowerOn_Led();
	MacAddr_Read();
	Aes_Key_Read();
	LANGroup_AddrRead();

	Get_WireLessChannel(Wireless_Channel);
    Wireless_Init();
    Si4438_Receive_Start(Wireless_Channel[0]);

  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */


  /* USER CODE BEGIN RTOS_THREADS */
  AppTaskCreate();
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }

  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
}

/* SPI1 init function */
static void MX_SPI1_Init(void)
{

  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

